routes/api.php

select * from `criterias`
---
    Route::get('/criterias', function() {
        return response()->json([
            'message' => 'All criterias.',
            'criterias' => Criteria::get()

select `id`, `name`, `assessment_type` from `tests` order by `id` desc
---
    Route::get('/all_tests', function() {
        return response()->json([
            'message' => 'All Test.',
            'tests' => Test::orderBy('id','desc')->select('id', 'name', 'assessment_type')->get()