app/Http/Controllers/V1/AssignController.php

    public function index(Request $request) {

        $search = "";
        if($request->has('search')) {
            $search = $request->search;
        }

        $assigned = Assigncandidate::with(['test'])
                    ->where(function($query) use($search) {
                        if($search) {
                            $query->where('email', 'like', '%'.$search.'%');
                        }
                    })
                    ->orderBy('status', 'asc')->orderBy('id', 'desc')
                    ->where('user_id', Auth::id())
                    ->paginate(10);
---
select * from `assign_candidates` where `user_id` = 2 order by `status` asc, `id` desc limit 10 offset 0
select * from `tests` where `tests`.`id` in (1, 3)
select count(*) as aggregate from `assign_candidates` where `user_id` = 2

    public function store(Request $request) {

        if(isset($request->lists)) {

            $assign = new Assign;
            $assign->user_id = Auth::id();
            $assign->created_at = Date('Y-m-d H:i:s');
            $assign->updated_at = Date('Y-m-d H:i:s');
            $assign->save();

            $start = Date('Y-m-d H:i:s', strtotime('+0 day'));
            $end = Date('Y-m-d H:i:s', strtotime('+1 day'));

            $resume = isset($request->settings['resume'])?$request->settings['resume']:0;

            if(isset($request->default_check)) {
                $start = Date('Y-m-d H:i:s', strtotime($request->settings['start']));
                $end = Date('Y-m-d H:i:s', strtotime($request->settings['end']));
            }

            foreach($request->lists as $list) {
                $checkCandidate = Assigncandidate::where('email', $list['email'])->where('test_id', $list['test_id'])->where('status', '0')->first();
---
select * from `assign_candidates` where `email` = 'test2@test.com' and `test_id` = 3 and `status` = '0' limit 1

                    $assign_candidate->assessment_type = $list['type'];
                    $assign_candidate->share = 0;
                    $assign_candidate->user_id = Auth::id();
                    $assign_candidate->save();
---
insert into `assign_candidates` (`assign_id`, `name`, `email`, `test_id`, `start`, `end`, `resume`, `assessment_type`, `share`, `user_id`, `updated_at`, `created_at`) values (8, 'test2', 'test2@test.com', 3, '2022-09-02 09:42:00', '2022-09-03 09:42:00', 1, 1, 0, 2, '2022-09-02 04:12:47', '2022-09-02 04:12:47')

    public function show($id) {

        $assign = Assign::where('id', $id)->where('user_id', Auth::id())->with(['candidates', 'candidates.test'])->first();
---
select * from `tests` where `tests`.`id` in (3)

    public function update(Request $request, Assign $assign) {

        if(!empty($request->lists) && $request->message) {

            $data['subject'] = 'Online Test';
            $data['lists'] = $request->lists;
            $data['message'] = $request->message;

            $job = (new \App\Jobs\SendEmail($data))
                ->delay(now()->addSeconds(2));

            $this->dispatch($job);

            return response()->json([
                'success' => true,
                'message' => 'Mail sent.',
            ], 200);

        }else if(isset($request->for) && $request->for == "update_assigned_candidate") {

            $mess = Assigncandidate::where('id', $request->id)
            ->update($request->candidate);
---
update `assign_candidates` set `email` = 'hello@test.com', `end` = '2022-09-03 05:47:00', `test_id` = 3, `name` = 'hello', `resume` = 1, `start` = '2022-09-01 06:21:00', `assign_candidates`.`updated_at` = '2022-09-01 12:50:03' where `id` = 5

    public function showCandidate($id) {
        $assign = Assigncandidate::where('id', $id)->where('user_id', Auth::id())->with(['test'])->first();
---
select * from `assign_candidates` where `id` = '5' and `user_id` = 2 limit 1
select * from `tests` where `tests`.`id` in (3)