app/Http/Controllers/V1/AuthController.php

    public function login(Request $request) {

        $validator = $request->validate([
            'email' => 'required|string|email|max:255',
            'password' => 'required|min:8',
        ]);

        if (!Auth::attempt($request->only('email', 'password'))) {
            return response()->json(['message' => 'Invalid login details'], 401);
        }

        $user = User::where('email', $request['email'])->firstOrFail();
---
select * from `users` where `email` = 'hr@admin.com' limit 1