app/Http/Controllers/V1/DashboardController.php

select * from `test_purpose` where `test_purpose`.`id` in (1, 3, 4)
select * from `test_questions` where `test_questions`.`test_id` in (1, 2, 3)
select * from `tests` where `user_id` = 2 order by `id` desc limit 5
select * from `assign_candidates` where `user_id` = 2 and `status` = 0 and date(`end`) > '2022-09-02' order by `id` desc limit 5
select * from `tests` where `tests`.`id` in (3)
select * from `test_takers` where `user_id` = 2 order by `id` desc limit 5
---
    public function index(request $request) {
        $user_id = Auth::id();
        $tests = Test::with(['purpose','test_questions'])
                ->where('user_id', $user_id)
                ->orderBy('id', 'desc')
                ->limit(5)
                ->get();

        $upcomming_test = Assigncandidate::with(['test'])
                    ->where('user_id', $user_id)
                    ->where('status', 0)
                    ->whereDate('end', '>', Carbon::now())
                    ->orderBy('id', 'desc')
                    ->limit(5)
                    ->get();

        $completed_test = Testtaker::where('user_id', $user_id)
                            ->orderBy('id', 'desc')
                            ->limit(5)
                            ->get();