app/Http/Controllers/V1/OnlinetestController.php

select * from `test_purpose` where `test_purpose`.`id` in (4)
select * from `tests` where `public_id` = '61dc35ca0ca4e' limit 1
select `criteria_id` from `test_settings` where `test_id` = 3
select * from `test_takers` where `test_id` = 3 and `created_at` between '2022-08-31 13:06:23' and '2022-08-31 13:36:23' and `status` = 1 limit 1
---
    public function index(Request $request, $public_id) {

        if($request->cid && $request->cid != 'YWRtaW4=') {
            $cid = base64_decode($request->cid);
            $candidate = Assigncandidate::where('id', $cid)->first();
            if(empty($candidate)) {
                return response()->json([
                    'success' => false,
                    'error' => 'You are not allowed to take test. Please contact your administrator for assistance.',
                ], 400);
            }

            if($candidate->start > Carbon::now() || $candidate->end < Carbon::now()) {
                return response()->json([
                    'success' => false,
                    'error' => 'Since this test has expired you cannot start a new test.',
                ], 400);
            }

            if($candidate->status == 1) {
                return response()->json([
                    'success' => false,
                    'error' => 'Test is already finished by You. So you cannot start a new test',
                ], 400);
            }
        }

        if($public_id) {
            $test = Test::with(['purpose', 'registation_fields'])
                    ->where('public_id', $public_id)
                    ->first();

            if(!empty($test)) {
                $test_settings = Testsetting::where('test_id', $test->id)->pluck('criteria_id');
                if (!in_array(10, $test_settings->toArray()) && $request->cid != 'admin') {
                    $checkTest = Testtaker::where('test_id', $test->id)
                                ->whereBetween('created_at', [Carbon::now()->subMinute(30), Carbon::now()])
                                ->where('status', 1)
                                ->first();

select `order`, `section_id` from `order_settings` where `test_id` = 3
select `instruction`, `section_id` from `section_settings` where `test_id` = 3
select COUNT(id) as total, `category_id` from `test_questions` where `test_id` = 3 group by `category_id`
select count(*) as aggregate from `test_questions` where `test_id` = 3
---
                    }
                }

                $order_settings = Ordersetting::where('test_id', $test->id)->pluck('order', 'section_id');
                $section_settings = Sectionsetting::where('test_id', $test->id)->pluck('instruction', 'section_id');
                $test_questions = Testquestion::with('category')
                                ->where('test_id', $test->id)
                                ->groupBy('category_id')
                                ->select(DB::raw('COUNT(id) as total'), 'category_id')
                                ->get();

                $total_questions = Testquestion::where('test_id', $test->id)->count();

select * from `test_questions` where `test_questions`.`test_id` in (3)
select * from `tests` where `id` = '3' limit 1
select * from `assign_candidates` where `test_id` = '3' and `email` = 'hello@test.com' and `share` = 1 and `status` = 0 and DATEDIFF(end , start) > 0 AND DATEDIFF(end , '2022-09-01 18:09:24') > 0 AND DATEDIFF('2022-09-01 18:09:24', start) > 0 order by `id` desc limit 1
select * from `test_takers` where `email` = '2@test.com' and `test_id` = '3' and `status` = 1 order by `id` desc limit 1
---
    public function registation(Request $request, $test_id) {

        if($test_id) {

            request()->validate([
                'email' => 'required|email|max:255',
                'name' => 'required|max:255'
            ]);

            $test = Test::where('id', $test_id)->with('test_questions', 'test_questions.question', 'test_questions.question.options', 'test_questions.category')->first();

            $total_marks = 0;
            if(!empty($test->test_questions)) {
                foreach($test->test_questions as $item) {
                    $total_marks = $total_marks + $item->question->marks;
                }
            }

            date_default_timezone_set('Asia/Kolkata');
            $currentDate = date("Y-m-d H:m:s");

            $candidate = Assigncandidate::where('test_id', $test_id)
                        ->where('email', $request->email)
                        ->where('share', 1)
                        ->whereRaw("status != 1 AND end > start AND end > '$currentDate' AND '$currentDate' > start")
                        ->orderBy('id', 'desc')
                        ->first();

            if(!empty($candidate) && !empty($test)) {
                $testTaker = Testtaker::where('email', $request->email)->where('test_id', $test_id)->where('status', 1)->orderBy('id', 'desc')->first();

insert into `test_takers` (`key`, `name`, `email`, `dob`, `gender`, `mobile`, `avatar`, `id_card`, `test_id`, `test_name`, `total_questions`, `total_marks`, `user_id`, `status`, `updated_at`, `created_at`) values ('630f32edae0bc', 'Deepak', 'test@test.com', '', '', '', '', '', '3', 'TEST', 2, 2, 2, 1, '2022-08-31 10:07:41', '2022-08-31 10:07:41')
---
                    $taker->total_marks = $total_marks;
                    $taker->user_id = $candidate->user_id;
                    $taker->status = 1;
                    $taker->save();

insert into `test_taker_answers` (`category`, `category_id`, `correct`, `created_at`, `marks`, `option_four`, `option_one`, `option_three`, `option_two`, `question`, `question_id`, `taker_id`, `test_id`, `updated_at`) values ('Numeric Ability and Data Analysis', 2, '3', '2022-09-01 18:12:50', 1, '9 km/hr', '3 km/hr', '8 km/hr', '5 km/hr', 'In one hour, a boat goes 11 km/hr along the stream and 5 km/hr against the stream. The speed of the boat in still water (in km/hr) is:', 5, 5, '3', '2022-09-01 18:12:50'), ('Attention to Details', 1, '2', '2022-09-01 18:12:50', 1, 'None', 'Alike', 'Both', 'Different', 'Column A  Column B  1562 N.E. Madison Ave  1562 N.W. Madison Ave', 15, 5, '3', '2022-09-01 18:12:50')
---
                        $i++;
                    }

                    Testtakeranswer::insert($answerLoad);

select `resume` from `assign_candidates` where `email` = '2@test.com' limit 1
---

                }
                else {
                    $isCanResume = Assigncandidate::select('resume')->where('email', $request->email)->first();

select * from `test_questions` where `test_id` = '3' and `category_id` = '1'
---
    public function question(Request $request, $test_id) {

        if($test_id) {
            $question = Testquestion::with('question', 'question.options', 'category')
                        ->where('test_id', $test_id)
                        ->where('category_id', $request->category_id)
                        ->paginate(1);

select * from `test_questions` where `test_id` = '3' and `category_id` = '1'
---
    public function questions(Request $request, $test_id) {
        if($test_id) {
            $questions = Testquestion::with('question', 'question.options', 'category')
                        ->where('test_id', $test_id)
                        ->where('category_id', $request->category_id)
                        ->get();

select * from `test_taker_answers` where (`taker_id` = 4 and `question_id` = 13 and `test_id` = 3) limit 1
---
    public function answered(Request $request) {
        if(isset($request->selected) && isset($request->question_id) && $request->taker_id) {

            $answered = $request->selected + 1;
            $create_update = Testtakeranswer::updateOrCreate([
                                'taker_id' => $request->taker_id,
                                'question_id' => $request->question_id,
                                'test_id' => $request->test_id,
                            ], [
                                'selected_option' => $answered
                            ]
                        );

update `test_takers` set `status` = 2, `test_takers`.`updated_at` = '2022-08-31 13:46:12' where `id` = '3'
update `assign_candidates` set `status` = 1, `assign_candidates`.`updated_at` = '2022-08-31 13:46:12' where `test_id` = 3 and `email` = 'test@test.com' and `status` = 0
---
    public function updateStatus(Request $request, $taker_id) {

        if($taker_id && $request->taker_id == $taker_id) {
            Testtaker::where('id', $taker_id)
                    ->update([
                        'status'=>2,
                        'updated_at' => Date('Y-m-d H:i:s')
                    ]);
            Assigncandidate::where('test_id', $request->id)
                ->where('email', $request->taker_email)
                ->where('status', 0)
                ->update(['status' => 1]);