app/Http/Controllers/V1/QuestionController.php

    public function show(Questionbank $question) {

        $options = Questionoption::where('question_id', $question->id)
                    ->where('user_id', Auth::id())
                    ->get();
---
select * from `question_options` where `question_id` = 5 and `user_id` = 2

    public function destroy(Questionbank $question) {
        Questionbank::where('id', $question->id)->where('user_id', Auth::id())->delete();
        Questionoption::where('question_id', $question->id)->where('user_id', Auth::id())->delete();

        Testquestion::where('question_id', $question->id)->delete();
---
delete from `question_options` where `question_id` = 5 and `user_id` = 2
delete from `test_questions` where `question_id` = 5