app/Http/Controllers/V1/ReportController.php

    public function index(request $request, $test_id) {

        $user_id = Auth::id();

        $takers = Testtaker::where('test_id', $test_id)
                    ->withCount(['answers AS correct_marks' => function($query) {
                        $query->whereColumn('correct','selected_option');
                        $query->select(DB::raw('sum(marks)'));
                    }])
                    ->where('user_id', $user_id)
                    ->where('status', 2)
                    ->orderBy('id', 'desc')
                    ->paginate(10);

        $takersProcess = Testtaker::where('test_id', $test_id)
                    ->withCount(['answers AS correct_marks' => function($query) {
                        $query->whereColumn('correct','selected_option');
                        $query->select(DB::raw('sum(marks)'));
                    }])
                    ->where('user_id', $user_id)
                    ->where('status', 1)
                    ->orderBy('id', 'desc')
                    ->paginate(10);

        $upcomming = Assigncandidate::with(['test'])
                    ->where('user_id', $user_id)
                    ->where('status', 0)
                    ->whereDate('end', '>', Carbon::now())
                    ->orderBy('id', 'desc')
                    ->paginate(10);
---
select count(*) as aggregate from `test_takers` where `test_id` = '3' and `user_id` = 2 and `status` = 2
select count(*) as aggregate from `test_takers` where `test_id` = '3' and `user_id` = 2 and `status` = 1
select * from `assign_candidates` where `user_id` = 2 and `test_id` = '3' and `status` = 0 and date(`end`) > '2022-09-01' order by `id` desc limit 10 offset 0
select * from `tests` where `tests`.`id` in (3)
select count(*) as aggregate from `assign_candidates` where `user_id` = 2 and `test_id` = '3' and `status` = 0 and date(`end`) > '2022-09-01'