app/Http/Controllers/V1/TestpurposeController.php

    public function index() {
        $purpose = Testpurpose::orderBy('id', 'asc')->get();
---
select * from `test_purpose` order by `id` asc