app/Http/Controllers/V1/TestController.php

    public function index(Request $request) {

        if($request->has('search')) {
            $search = $request->search;
        }

        if($request->test) {
            $tests = Test::with('purpose')
                        ->where('user_id', Auth::id())
                        ->select('id', 'name')
                        ->orderBy('id', 'desc')
                        ->get();

            return response()->json([
                'success' => true,
                'message' => 'All Question.',
                'tests' => $tests
            ], 200);
        }
        else {
            $tests = Test::with(['purpose','test_questions'])
                        ->withCount(['taker'])
                        ->where(function($query) use($search) {
                            if($search) {
                                $query->where('name', 'like', '%'.$search.'%');
                            }
                        })
                        ->where('user_id', Auth::id())
                        ->orderBy('id', 'desc')
                        ->paginate(10);
---
select * from `test_purpose` where `test_purpose`.`id` in (1, 3, 4)
select * from `test_questions` where `test_questions`.`test_id` in (1, 2, 3)
select count(*) as aggregate from `tests` where `user_id` = 2

    public function show(Test $test) {

        $test_settings = Testsetting::where('test_id', $test->id)
                            ->where('user_id', Auth::id())
                            ->pluck('criteria_id');

        $section_settings = Sectionsetting::where('test_id', $test->id)
                            ->where('user_id', Auth::id())
                            ->pluck('instruction', 'section_id');

        $order_settings = Ordersetting::where('test_id', $test->id)
                            ->where('user_id', Auth::id())
                            ->pluck('order', 'section_id');

        $test_questions = Testquestion::with(['question', 'category'])
                            ->where('user_id', Auth::id())
                            ->where('test_id', $test->id)
                            ->orderBy('id', 'asc')
                            ->get();
---
select `criteria_id` from `test_settings` where `test_id` = 3 and `user_id` = 2
select `instruction`, `section_id` from `section_settings` where `test_id` = 3 and `user_id` = 2
select `order`, `section_id` from `order_settings` where `test_id` = 3 and `user_id` = 2
select * from `test_questions` where `user_id` = 2 and `test_id` = 3 order by `id` asc

            $i++;
        }

        Testquestion::where('test_id', $test->id)->where('user_id', Auth::id())->delete();
        if(!empty($allQuestions)) {
            Testquestion::insert($allQuestions);
---
delete from `test_questions` where `test_id` = 3 and `user_id` = 2
insert into `test_questions` (`category_id`, `created_at`, `question_id`, `test_id`, `updated_at`, `user_id`) values (1, '2022-09-01 06:58:04', 14, 3, '2022-09-01 06:58:04', 2), (1, '2022-09-01 06:58:04', 13, 3, '2022-09-01 06:58:04', 2), (2, '2022-09-01 06:58:04', 4, 3, '2022-09-01 06:58:04', 2), (2, '2022-09-01 06:58:04', 3, 3, '2022-09-01 06:58:04', 2), (2, '2022-09-01 06:58:04', 2, 3, '2022-09-01 06:58:04', 2), (3, '2022-09-01 06:58:04', 10, 3, '2022-09-01 06:58:04', 2), (3, '2022-09-01 06:58:04', 6, 3, '2022-09-01 06:58:04', 2)

            }
        }

        Testsetting::where('test_id', $test->id)->where('user_id', Auth::id())->delete();
        if(!empty($test_settings)) {
            Testsetting::insert($test_settings);
---
delete from `test_settings` where `test_id` = 3 and `user_id` = 2
insert into `test_settings` (`created_at`, `criteria_id`, `test_id`, `updated_at`, `user_id`) values ('2022-09-01 06:58:04', 1, 3, '2022-09-01 06:58:04', 2), ('2022-09-01 06:58:04', 2, 3, '2022-09-01 06:58:04', 2), ('2022-09-01 06:58:04', 10, 3, '2022-09-01 06:58:04', 2)

            }
        }

        Sectionsetting::where('test_id', $test->id)->where('user_id', Auth::id())->delete();
        if(!empty($section_settings)) {
            Sectionsetting::insert($section_settings);
---
delete from `section_settings` where `test_id` = 3 and `user_id` = 2
insert into `section_settings` (`created_at`, `instruction`, `section_id`, `test_id`, `updated_at`, `user_id`) values ('2022-09-01 06:58:04', 'ewrewrewr', 1, 3, '2022-09-01 06:58:04', 2), ('2022-09-01 06:58:04', 'ewrewr', 2, 3, '2022-09-01 06:58:04', 2), ('2022-09-01 06:58:04', 'ewrewr', 3, 3, '2022-09-01 06:58:04', 2), ('2022-09-01 06:58:04', 'ewrewr', 4, 3, '2022-09-01 06:58:04', 2)

            }
        }

        Ordersetting::where('test_id', $test->id)->where('user_id', Auth::id())->delete();
---
delete from `order_settings` where `test_id` = 3 and `user_id` = 2

    public function questions($test_id) {
        $test = Test::where('id', $test_id)->where('user_id', Auth::id())->select('id', 'name')->first();
        $test_questions = Testquestion::where('test_id', $test_id)->where('user_id', Auth::id())->with(['question', 'category'])->paginate(10);
---
select `id`, `name` from `tests` where `id` = '3' and `user_id` = 2 limit 1
select * from `test_questions` where `test_id` = '3' and `user_id` = 2 limit 10 offset 0
select count(*) as aggregate from `test_questions` where `test_id` = '3' and `user_id` = 2