app/Jobs/SendEmail.php

select * from `tests` where `id` = 3 limit 1
---
    public function handle()
    {

        $subject = $this->data['subject'];

        foreach ($this->data['lists'] as $list) {

            $inputs = [
                'email' => $list['email'],
                'name' => $list['name'],
                'subject' => $subject
            ];

            $job_role = '';
            if($list['test_id']) {
                $test = Test::where('id', $list['test_id'])->first();

update `assign_candidates` set `status` = '0', `share` = 1, `assign_candidates`.`updated_at` = '2022-08-31 10:16:53' where `id` = 2
---
                    $message->to($inputs['email'], $inputs['name'])
                        ->subject($inputs['subject']);
                });
                Assigncandidate::where('id', $list['id'])->update(['status' => '0', 'share' => 1, 'updated_at' => Date('Y-m-d H:i:s')]);